Tekla Open API Reference for Tekla Structures 2025
DetailMarkTagsAttributes.TagA2 Property
 The tag A2 of a mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewMarkBasicTagAttributes TagA2 { get; set; }
Public Property TagA2 As ViewMarkBasicTagAttributes
	Get
	Set
Property Value
Type: ViewMarkBasicTagAttributes
See Also
Reference
DetailMarkTagsAttributes Class
Tekla.Structures.Drawing Namespace